Revit 2022 API
IndependentTag.SetLeaderElbow Method
 Set the position of the elbow of the tag's leader that points to specified reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2022
Syntax
C#
public void SetLeaderElbow(
	Reference referenceTagged,
	XYZ pntElbow
)
Visual Basic
Public Sub SetLeaderElbow ( _
	referenceTagged As Reference, _
	pntElbow As XYZ _
)
Visual C++
public:
void SetLeaderElbow(
	Reference^ referenceTagged,
	XYZ^ pntElbow
)
Parameters
referenceTagged
Type: Autodesk.Revit.DB.Reference
 The reference which is tagged.
pntElbow
Type: Autodesk.Revit.DB.XYZ
Remarks
 Straight leaders do not have elbow points.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The specified reference is not currently tagged.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The tag does not have a leader.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace